{"terms":[{"term":"Jane Addams","def":"Upper class protestant who wanted reform in the industrialized world. Also anti imperialist","id":0,"wrong":1},{"term":"Hull House","def":"Started by Jane Addams. Cared for children while parents were working. Exposed issues with industrial working conditions","id":1,"right":1},{"term":"Nativism","def":"Hating immigrants, racism towards americans who were not WASPS. Only want native born people in US.","id":2,"wrong":0,"right":1},{"term":"National Consumers League","def":"Tried to oppose harsh working conditions of the industrial revolution","id":3,"right":1},{"term":"Triangle Shirtwaist Company","def":"Company during the end of the industrial revolution. A fire in one of their factories brought many of the issues of the industrial revolution to light. Led to many progressives calling for change","id":4},{"term":"Fundamentalism","def":"The idea of taking the bible literally","id":5},{"term":"John Scopes","def":"Substitute teacher who taught evolution in class to challenge fundamentalists and the butler act.","id":6},{"term":"Hepburn Act","def":"Govt regulated interstate commerce and limited railroad rates","id":7,"wrong":1},{"term":"New Freedom","def":"Woodrow Wilson’s philosophy of encouraging small business.","id":8},{"term":"Progressive Party","def":"Roosevelt’s political party. Formed to advocate for political, social, and industrial reform.","id":9},{"term":"Muckrakers","def":"Journalists who exposed issues in politics and industry. Led many to call for reform.","id":10,"right":1},{"term":"Social Gospel Movement","def":"Movement advocating for Christians to confront sins of society. Led to more religious people","id":11},{"term":"Yellow Journalism","def":"Journalists capitalizing on war by sensationalizing the atrocities in Cuba, and leading many americans to call for war.","id":12,"wrong":2},{"term":"Rough Riders","def":"US army unit during the Spanish American War. Led by Theodore Roosevelt.","id":13,"wrong":1},{"term":"Treaty of Paris","def":"Treaty ending Revolutionary War.","id":14},{"term":"Platt Amendment","def":"Allowed US to use force in Cuba. Established Guantanamo Bay. Set precedent for US to use military power for national interests","id":15,"wrong":2},{"term":"Roosevelt Corollary","def":"US foreign policy. US has right to intervene in Latin America with military power.","id":16,"wrong":1},{"term":"Open Door Policy","def":"Called for all western powers to have equal access to trade in china.","id":17},{"term":"Big Stick Policy","def":"Roosevelt’s policy of peaceful negation with some intimidation","id":18,"wrong":1},{"term":"Lusitania","def":"Cruise ship sunken by German submarines during WWI. Americans were upset over the deaths of the americans onboard. Helped to draw America into WWI.","id":19,"right":1},{"term":"Zimmermann Telegram","def":"A telegram from Germany to Mexico offering support should Mexico decide to attack the US. Angered Americans and helped to draw America into WWI.","id":20,"right":1},{"term":"Committee on Public Information","def":"A committee formed to influence the public using propaganda during WWI.","id":21},{"term":"Espionage Act & Sedition Act","def":"Acts passed under Woodrow Wilson which made it illegal to interfere with recruitment of soldiers, wartime operations, and other military fun stuff.","id":22},{"term":"Red Scare","def":"The fear of communists following WWI.","id":23,"right":1},{"term":"A Mitchell Palmer","def":"Defense Attorney who made the country paranoid about communists.","id":24,"right":1},{"term":"Palmer Raids","def":"Hundreds of raids led by A. Mitchell Palmer as he hunted down anyone suspected of being a communist. Was allowed to continue since the country was terrified by communists","id":25},{"term":"Cruikshank v. US","def":"Supreme court ruling against 2nd amendment. Shows the style of government at the end of the 19th century, as well as how loosely the constitution can be interpreted."},{"term":"Jim Crow","def":"Racism towards African Americans in the Southern States. Institutionalized in jim crow laws"},{"term":"League of Nations","def":"A international organization with the goal of creating peace following WWI. Pushed for by Woodrow Wilson, yet the US never joined."},{"term":"Fourteen Points","def":"Woodrow Wilson’s proposed plan to congress to achieve world peace (League of Nations)."},{"term":"The Jazz Singer","def":"First ever talkie","id":30,"right":1},{"term":"Adkins v. Children’s Hospital","def":"Court case which made it illegal to have a special min wage for women. Shows how women were now seen as being able to take care of themselves."},{"term":"Muller v. Oregon","def":"Court case which made it legal to limit women working hours. Shows gender stereotypes"},{"term":"Clarence Darrow and William Jennings Bryan","def":"Both involved in the Scopes Trial. Clarence Darrow was a attorney who volunteered to defend John T. Scopes. William Jennings Bryan prosecuted Scopes. Brought the conflicts of the 1920s (Spec. Fundamentalism vs Science) to light."},{"term":"Henry Ford","def":"American entrepreneur. Founded the Ford Motor Company. Assembly Line. Industrialization. Consumerism","id":34,"right":1},{"term":"American Plan: Welfare capitalism","def":"An economic model. Capitalism but with comprehensive welfare policies.","id":35},{"term":"Volstead Act","def":"Implemented and enforced 18th amendment (Prohibition)."},{"term":"Speakeasies","def":"Underground bars that popped up during the prohibition"},{"term":"Bootlegging","def":"The illegal sale, transport, production, and consumption of alcohol during the prohibition."},{"term":"Anti-Saloon League","def":"A progressive group that pushed for prohibition.","id":39,"right":1},{"term":"Butler Act","def":"An act passed in Tennessee during the 1920s. Banned the teaching of evolution in public schools. Led to the Scopes Trial."},{"term":"Stone Mountain","def":"Famous mountain atop which the new KKK was created. Cross was burned there.","id":41,"right":1},{"term":"Sacco & Vanzetti","def":"Two Italian anarchists who were executed for the murder of a man, despite a lack of evidence. Highlighted issues with the legal system of the time. They were killed for being anarchists, not for the murder."},{"term":"New Nationalism","def":"Roosevelt & Wilson philosophy that fed power must be increased to lessen corporate power."},{"term":"Sherman Anti-trust Act","def":"Limited anticompetitive practices. Shift from laissez-faire to more hands on."},{"term":"Clayton Anti-trust Act","def":"Enhanced the Sherman anti trust act. Shift from laissez-faire to more hands on."},{"term":"Ozawa v. US","def":"Second generation immigrant, was born in the US, learned English, and waited a long time to become an American citizen. Sued the US to become a citizen. Denied due to race. (!white)","id":46,"right":1},{"term":"Madison Grant","def":"Infamous Eugenicist. Crafted anti immigration and interracial marriage laws. Wrote the Passing of a great race."},{"term":"Charles Davenport","def":"Leader of American Eugenics Movement"},{"term":"Buck v. Bell","def":"Court cased that approved forced sterilization"},{"term":"The Jukes","def":"A family to which all criminals could allegedly be traced. Pseudoscience, used to support racist views that some races were more likely to commit crime."},{"term":"Lost Generation (Hemingway, Fitzgerald)","def":"Generation of writers disillusioned by WWI. Found no audience in US (normalcy), so moved to Paris.","id":51,"right":1},{"term":"Hiram Evans","def":"Imperial Wizard of KKK. Helped KKK to rapidly grow in size and political power"},{"term":"1924 National Origins Act","def":"Limited how many immigrants were allowed (3% of 1890 census)","id":53,"right":1},{"term":"Flappers","def":"1920s women who broke conventional social barriers. Drank alcohol and smoked. Dressed less conservatively, partied."},{"term":"Margaret Sanger","def":"Promoted use of contraceptives, against Comstock laws."},{"term":"Normalcy","def":"The idea that the US (& world) should do it’s best to try and return to normal following WWI."},{"term":"Booker T. Washington","def":"Famous African American. Encouraged African Americans to work their way into American society by working up the social latter."},{"term":"W.E.B. DuBois","def":"Harlem Renaissance activist and writer. First African American PhD form Harvard. Cofounded the NAACP."},{"term":"Panama Canal","def":"The US’s canal built in Panama for trade reasons. Roosevelt had to go around congress to get the project started, and had to start a revolution to free panama from Columbia."},{"term":"NAACP","def":"National Association for the Advancement of Colored People","id":60,"right":1},{"term":"Claude McKay","def":"Jamaican Born American writer/poet. Key to Harlem Renaissance."},{"term":"Langston Hughes","def":"American poet/social activist. Jazz poetry"},{"term":"William Simmons","def":"Rebuilt the KKK. Became imperial wizard. Became key to KKK after lynching of Leo Frank","id":63,"wrong":1},{"term":"Slaughterhouse Cases","def":"Supreme court ruling that an individual’s privileges are protected by the 14th amendment"},{"term":"Plessy v. Ferguson","def":"Segregation is a okay, if equal","id":65,"wrong":1,"right":1},{"term":"Williams v. Mississippi","def":"Tried to end literacy tests for voting. Failed.","id":66,"wrong":1},{"term":"Debs v. US","def":"Eugene Debs (socialist) was tried for breaking the espionage act. Was the espionage act breaking the freedom of speech?","id":67,"right":1},{"term":"Robert LaFollette","def":"Created Wisconsin Idea to help regulate railroad workers. Safety regulations and worker’s compensation."},{"term":"Francis Galton","def":"Father of Eugenics."},{"term":"Women’s Christian Temperance Union","def":"Led by Frances Willard. Promoted temperance in society. Led to 18th Ammendment (prohibition)","id":70,"right":1},{"term":"Extralegal Justice","def":"Justice done by citizens, done outside of the legal system. Did not involve courts or police. Usually lynching."},{"term":"Anti-Imperialist League","def":"Did not support imperialism, esp. annexation of Phillipines.","id":72,"right":1},{"term":"Eugene Debs","def":"Union Leader and founder of socialist party. Went against draft."},{"term":"Birth of a Nation","def":"Racist movie (1920s?). Brought about the rebirth of the KKK."},{"term":"1921 Johnson Act","def":"Limited immigration to 3% of current population."},{"term":"Rudolph Valentino","def":"Early American actor.","id":76,"right":1},{"term":"Clara Bow","def":"Early American actress.","id":77,"right":1},{"term":"Al Capone","def":"infamous gangster during the prohibition era."},{"term":"Cotton Club","def":"New York night club. First in Harlem. Many white patrons, and many African American employees."},{"term":"Louie Armstrong","def":"Musician during the 1920s","id":80,"right":1},{"term":"Oliver Wendell Holmes","def":"Associate Justice of Supreme Court. Pro eugenics"},{"term":"Talkies","def":"Movies/Television with sound. Came about in the late 1920s, replaced silent films. Became a popular form of entertainment"}]}
